Repository: NicolaLS/payment-app
Catalog: apps/flint/feature/wallet-connection/src/iosMain/resources/FlintWalletConnection.xcstrings
Source language: en
Languages: de, es

# wallet_cancel
source: CANCEL
de: ABBRECHEN
es: CANCELAR

# wallet_credential_corrupt
source: The protected recovery phrase or its device key is inconsistent.
de: Die geschützte Wiederherstellungsphrase oder ihr Geräteschlüssel ist inkonsistent.
es: La frase de recuperación protegida o su clave del dispositivo son inconsistentes.

# wallet_credential_invalidated
source: Device security changed and the protected recovery phrase can no longer be decrypted.
de: Die Gerätesicherheit wurde geändert und die geschützte Wiederherstellungsphrase kann nicht mehr entschlüsselt werden.
es: La seguridad del dispositivo cambió y la frase de recuperación protegida ya no se puede descifrar.

# wallet_credential_title
source: Wallet credential unavailable.
de: Wallet-Anmeldedaten nicht verfügbar.
es: Credencial de la billetera no disponible.

# wallet_credential_unavailable
source: The protected recovery phrase is temporarily unavailable. Unlock the device and retry.
de: Die geschützte Wiederherstellungsphrase ist vorübergehend nicht verfügbar. Entsperre das Gerät und versuche es erneut.
es: La frase de recuperación protegida no está disponible temporalmente. Desbloquea el dispositivo y vuelve a intentarlo.

# wallet_error_already_configured
source: A wallet is already configured. Remove it before importing another.
de: Eine Wallet ist bereits eingerichtet. Entferne sie, bevor du eine andere importierst.
es: Ya hay una billetera configurada. Quítala antes de importar otra.

# wallet_error_connection
source: Could not open this wallet. Check the recovery phrase and internet connection, then try again.
de: Diese Wallet konnte nicht geöffnet werden. Prüfe die Wiederherstellungsphrase und Internetverbindung und versuche es erneut.
es: No se pudo abrir esta billetera. Revisa la frase de recuperación y la conexión a internet, e inténtalo de nuevo.

# wallet_error_invalid_mnemonic
source: Enter a valid 12, 15, 18, 21, or 24 word recovery phrase.
de: Gib eine gültige Wiederherstellungsphrase mit 12, 15, 18, 21 oder 24 Wörtern ein.
es: Ingresa una frase de recuperación válida de 12, 15, 18, 21 o 24 palabras.

# wallet_error_reset
source: Cleanup is incomplete. Retry reset before importing another wallet.
de: Die Bereinigung ist unvollständig. Wiederhole das Zurücksetzen, bevor du eine andere Wallet importierst.
es: La limpieza está incompleta. Reintenta el restablecimiento antes de importar otra billetera.

# wallet_error_storage
source: The wallet opened, but its recovery phrase could not be protected on this device.
de: Die Wallet wurde geöffnet, aber ihre Wiederherstellungsphrase konnte auf diesem Gerät nicht geschützt werden.
es: La billetera se abrió, pero su frase de recuperación no se pudo proteger en este dispositivo.

# wallet_import_action
source: IMPORT WALLET
de: WALLET IMPORTIEREN
es: IMPORTAR BILLETERA

# wallet_import_body
source: Importing a recovery phrase gives Flint spending authority. Keep your primary wallet installed for recovery and full wallet management.
de: Durch den Import einer Wiederherstellungsphrase erhält Flint Ausgabeberechtigung. Behalte deine primäre Wallet für Wiederherstellung und vollständige Verwaltung installiert.
es: Importar una frase de recuperación otorga a Flint autorización para gastar. Conserva tu billetera principal instalada para recuperar y administrar la billetera por completo.

# wallet_import_title
source: Connect your payment wallet.
de: Zahlungs-Wallet verbinden.
es: Conecta tu billetera de pagos.

# wallet_phrase_hint
source: twelve or twenty-four words…
de: zwölf oder vierundzwanzig Wörter…
es: doce o veinticuatro palabras…

# wallet_phrase_label
source: BIP39 recovery phrase
de: BIP39-Wiederherstellungsphrase
es: Frase de recuperación BIP39

# wallet_progress_connecting
source: Connecting wallet…
de: Wallet wird verbunden…
es: Conectando billetera…

# wallet_progress_loading
source: Checking wallet access…
de: Wallet-Zugriff wird geprüft…
es: Comprobando acceso a la billetera…

# wallet_progress_removing
source: Removing local wallet access…
de: Lokaler Wallet-Zugriff wird entfernt…
es: Quitando acceso local a la billetera…

# wallet_progress_working
source: Working…
de: Wird verarbeitet…
es: Procesando…

# wallet_reconnect_body
source: Flint still has the recovery phrase securely stored. Check your internet connection and retry, or remove the wallet from Flint.
de: Flint hat die Wiederherstellungsphrase weiterhin sicher gespeichert. Prüfe deine Internetverbindung und versuche es erneut oder entferne die Wallet aus Flint.
es: Flint todavía tiene guardada la frase de recuperación de forma segura. Revisa tu conexión a internet y vuelve a intentarlo, o quita la billetera de Flint.

# wallet_reconnect_title
source: Could not open this wallet.
de: Diese Wallet konnte nicht geöffnet werden.
es: No se pudo abrir esta billetera.

# wallet_remove_body
source: This deletes its protected phrase, payment activity, and local SDK data.
de: Dadurch werden die geschützte Phrase, Zahlungsaktivitäten und lokale SDK-Daten gelöscht.
es: Esto elimina la frase protegida, la actividad de pagos y los datos locales del SDK.

# wallet_remove_confirm
source: CONFIRM REMOVAL
de: ENTFERNEN BESTÄTIGEN
es: CONFIRMAR ELIMINACIÓN

# wallet_remove_title
source: Remove this wallet from Flint?
de: Diese Wallet aus Flint entfernen?
es: ¿Quitar esta billetera de Flint?

# wallet_reset_action
source: REMOVE WALLET FROM FLINT
de: WALLET AUS FLINT ENTFERNEN
es: QUITAR BILLETERA DE FLINT

# wallet_reset_body
source: Retry cleanup before importing another wallet.
de: Wiederhole die Bereinigung, bevor du eine andere Wallet importierst.
es: Reintenta la limpieza antes de importar otra billetera.

# wallet_reset_title
source: Wallet cleanup is incomplete.
de: Die Wallet-Bereinigung ist unvollständig.
es: La limpieza de la billetera está incompleta.

# wallet_retry
source: RETRY
de: ERNEUT VERSUCHEN
es: REINTENTAR

# wallet_storage_note
source: Protected using this device's secure credential storage.
de: Mit dem sicheren Anmeldedatenspeicher dieses Geräts geschützt.
es: Protegida con el almacenamiento seguro de credenciales de este dispositivo.
